# Homework_4
# 1. Користувач вводить рядок з клавіатури. Порахуйте кількість літер, цифр у рядку.
# Виведіть обидві кількості на екран. (використовувати цикл)
# 2. Користувач вводить з клавіатури рядок та символ для пошуку.
# Порахуйте скільки разів у рядку зустрічається потрібний символ. Отримане число виведіть на екран.
# 3. Користувач вводить з клавіатури рядок, слово для пошуку, слово для заміни.
# Зробіть у рядку заміну одного слова на інше. Отриманий рядок на екрані.

# 4. Дано рядок. (зробити зрізи)
# - Спершу виведіть третій символ цього рядка.
# - У другому рядку виведіть передостанній символ цього рядка.
# - У третьому рядку виведіть перші п'ять символів цього рядка.
# - У четвертому рядку виведіть весь рядок, крім двох останніх символів.
# - У п'ятому рядку виведіть усі символи з парними індексами
# (вважаючи, що індексація починається з 0, тому символи виводяться з першого).
# - У шостому рядку виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
# - У сьомому рядку виведіть усі символи у зворотному порядку.
# - У восьмому рядку виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
# - У дев'ятому рядку виведіть довжину цього рядка.

# Task_1
# try:
#     while True:
#         user_input = input("Введіть рядок: ")
#
#         letters_count = 0
#         digits_count = 0
#
#         for i in user_input:
#             if i.isalpha():
#                 letters_count += 1
#             elif i.isdigit():
#                 digits_count += 1
#
#         print(f"Кількість літер: {letters_count}")
#         print(f"Кількість цифр: {digits_count}")
#
# except Exception as e:
#     print(f"Виникла помилка: {e}")


# Task_2

# try:
#     while True:
#         user_string = input("Введіть рядок: ")
#         user_symbol = input("Введіть символ: ")
#
#         symbols_count = 0
#
#         for i in user_string:
#             if i == user_symbol:
#                 symbols_count += 1
#
#         print(f"Кількість символів в рядку: {symbols_count}")
#
# except Exception as e:
#     print(f"Виникла помилка: {e}")

